PLAYER_NUMBER = 'Введите количество игроков: '
PLAYERS_MOVE = 'Ход игрока с номером: '
YOUR_POPULATION = 'Население вашего государства: '
YOUR_ECONOMY = 'Ваша экономика: '
YOUR_MILITARY_POWER = 'Военная мощь государства: '
YOUR_SCIENCE = 'Наука и технологии: '
YOUR_RESOURCES = 'Ваши ресурсы: '
YOUR_TERRITORY = 'Ваши территории: '
GROW_POPULATION = 'Численность населения увеличена на'
DECLINE_POPULATION = 'Численность населения уменьшена на'
GROW_MILITARY = 'Военное преимущество увеличилась на'
DECLINE_MILITARY = 'Военная мощь снизилась на'
GROW_SCIENCE = 'Наука и технологии развиты на'
DECLINE_SCIENCE = 'Потери в развитии науки и технологи составляют'
GROW_RESOURCES = 'Запасы ресурсов пополнены на'
DECLINE_RESOURCES = 'Потрачено единиц ресурсов:'
GROW_TERRITORY = 'Территория расширена на'
DECLINE_TERRITORY = 'Территория уменьшилась на'
GROW_ECONOMY = 'Объём экономики вырос на'
DECLINE_ECONOMY = 'Объём экономики уменьшился на'
TRY_AGAIN = 'Вы ввели неправильно, попробуйте ещё раз'
NO_EVENTS = 'Никаких событий не произошло'
YES = "1)Да"
NO = "2)Нет"
EAT = "Посадить продовольствие?"
EAT2 = 'Какую часть территории вы собираетесь выделить?'
SCIENCE = 'Использовать 25 ед ресурсов для развития науки на 1 единицу?'
MILITARY = 'Использовать 25 ед ресурсов для повышения военной мощи государства на 1 единицу?'
TERRITORY = 'Отправить рабочих на освоение примыкающей к государству лесной местности?'
QUANTITY = "Введите количество:"
REFORM = f"""Вы можете провести масштабные реформы в сферах: экономики, социальной и государственного регулирования.
                Стоимость: 350 единиц ресурсов, 100 единиц территории.\n
                Повышает экономику государства на 1 балл.\n"""
CARRY = '1)Провести'
NOT_CARRY = '2)Не проводить'
NO_RESOURCES = 'Недостаточно ресурсов, попробуйте в другой раз.'
EDIT_RES = 'Вам повезло, вы сохранили доступные ресурсы'
BURN_PLACE = (f'Ваше государство обнаруживает новое месторождение ценного ресурса. Решите, как лучше использовать эту находку:'
              f'1)На развитие науки и технологий\n'
              f'2)Увеличить военное преимущества\n'
              f'3)Сохранить для возможного использования в будущем\n')
NATURE_EVENT = (f'В вашем государстве происходит природная катастрофа. Необходимо быстро принять решение о том, '
               f'как справиться с последствиями: \n'
               f'1)Отправить часть населения на пораженные зоны\n'
               f'2)Никак не реагировать\n')
CONFLICT = (f'На границе вашего государства возникает конфликт с соседями. Нужно решить, как реагировать: \n'
            f'1)Попытаться разрешить ситуацию мирным путем\n'
            f'2)Применить силу\n')
SECOND_REFORM = (f'Один из ваших министров предлагает провести реформы, на их проведение затребуется некоторое '
                 f'количество ресурсов. Рассмотрите предложение и решите, стоит ли его принимать. \n'
                 f'1)Рискуем\n'
                 f'2)Они того не стоят\n')
SUCCESS = 'Реформы оказались удачными:\n Коэфициент роста популяции увеличен'
NO_RESOURCES2 = 'На проведение реформы ваших запасов будет недостаточно, попробуйте принять другое решение\n'
OPEN_SCIENCE = 'В вашем государстве происходит научное открытие. \n'
POPUL = (f'Приток беженцев из соседнего государства в связи с военными действиями на его территории. '
         f'Примите решение \n'
         f'1)Впускаем всех\n'
         f'2)Закрываем границы\n')
MEDICINE = (f' Ваше государство сталкивается с проблемой нехватки медикаментов. Решите, как действовать:\n'
            f'1)Ввести нормирование медикаментов\n'
            f'2)Начать разработку новой технологии производства\n')
MILITARY_UP = ('Представители другого государства предлагают провести совместные военные учения.')
APPLY = '1) Согласиться'
DECLINE = '2) Отказаться'
ATTACK = (f' Ваше государство подвергается внезапному нападению со стороны одного из соседних государств.\n'
          f'Примите решение:\n'
          f'1)Оказать сопротивление\n'
          f'2)Попытаться договориться\n')
SUCCESS_ATTACK = (f'Ваше воиско оказалось на порядок способнее, нападавшие были успешно разгромлены.'
                  f'Вы присоеденили себе часть их государство.')
UNLUCKY_ATTACK = (f'Ваши военные оказались слишком слабы,'
                  f' но вы смогли прогнать обидчиков.')
DIPLOMACY = 'Успех, дипломатия вашего государства на высшем уровне.'
NO_DIPLOMACY = 'Нападавшие не стали вас слушать, у вас не осталось иного выбора, как защищаться'
VERY_SUCCESS_ATTACK = (f'Ваше воиско оказалось на порядок способнее, нападавшие были успешно разгромлены.'
                       f'Вы присоеденили себе часть их государство.')
VERY_UNLUCKY_ATTACK = (f'Ваши военные оказались слишком слабы.'
                       f'Вас прогнали.')
PEACE = (f'Одно из соседних государств предлагает вам заключить союз.\n'
                       f'1)Согласиться\n'
                       f'2)Напасть, пока этого не ждут.\n')
NUMBER = 'Ведите число: '
MENU = (f"""
Меню:
0) Статистика
1) Посадить зерно
2) Развивать науку
3) Повысить военную мощь
4) Освоение территории
5) Провести реформы
""")